Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ06GS202.h
#define _RPINR31_FLT4R0_POSITION                 0x00000000
#define _RPINR31_FLT4R0_MASK                     0x00000001
#define _RPINR31_FLT4R0_LENGTH                   0x00000001

#define _RPINR31_FLT4R1_POSITION                 0x00000001
#define _RPINR31_FLT4R1_MASK                     0x00000002
#define _RPINR31_FLT4R1_LENGTH                   0x00000001

#define _RPINR31_FLT4R2_POSITION                 0x00000002
#define _RPINR31_FLT4R2_MASK                     0x00000004
#define _RPINR31_FLT4R2_LENGTH                   0x00000001

#define _RPINR31_FLT4R3_POSITION                 0x00000003
#define _RPINR31_FLT4R3_MASK                     0x00000008
#define _RPINR31_FLT4R3_LENGTH                   0x00000001

#define _RPINR31_FLT4R4_POSITION                 0x00000004
#define _RPINR31_FLT4R4_MASK                     0x00000010
#define _RPINR31_FLT4R4_LENGTH                   0x00000001

#define _RPINR31_FLT4R5_POSITION                 0x00000005
#define _RPINR31_FLT4R5_MASK                     0x00000020
#define _RPINR31_FLT4R5_LENGTH                   0x00000001

#define _RPINR31_FLT5R0_POSITION                 0x00000008
#define _RPINR31_FLT5R0_MASK                     0x00000100
#define _RPINR31_FLT5R0_LENGTH                   0x00000001

#define _RPINR31_FLT5R1_POSITION                 0x00000009
#define _RPINR31_FLT5R1_MASK                     0x00000200
#define _RPINR31_FLT5R1_LENGTH                   0x00000001

#define _RPINR31_FLT5R2_POSITION                 0x0000000A
#define _RPINR31_FLT5R2_MASK                     0x00000400
#define _RPINR31_FLT5R2_LENGTH                   0x00000001

#define _RPINR31_FLT5R3_POSITION                 0x0000000B
#define _RPINR31_FLT5R3_MASK                     0x00000800
#define _RPINR31_FLT5R3_LENGTH                   0x00000001

#define _RPINR31_FLT5R4_POSITION                 0x0000000C
#define _RPINR31_FLT5R4_MASK                     0x00001000
#define _RPINR31_FLT5R4_LENGTH                   0x00000001

#define _RPINR31_FLT5R5_POSITION                 0x0000000D
#define _RPINR31_FLT5R5_MASK                     0x00002000
#define _RPINR31_FLT5R5_LENGTH                   0x00000001

#define _RPINR32_FLT6R_POSITION                  0x00000000
#define _RPINR32_FLT6R_MASK                      0x0000003F
#define _RPINR32_FLT6R_LENGTH                    0x00000006

#define _RPINR32_FLT7R_POSITION                  0x00000008
#define _RPINR32_FLT7R_MASK                      0x00003F00
#define _RPINR32_FLT7R_LENGTH                    0x00000006

#define _RPINR32_FLT6R0_POSITION                 0x00000000
#define _RPINR32_FLT6R0_MASK                     0x00000001
#define _RPINR32_FLT6R0_LENGTH                   0x00000001

#define _RPINR32_FLT6R1_POSITION                 0x00000001
#define _RPINR32_FLT6R1_MASK                     0x00000002
#define _RPINR32_FLT6R1_LENGTH                   0x00000001

#define _RPINR32_FLT6R2_POSITION                 0x00000002
#define _RPINR32_FLT6R2_MASK                     0x00000004
#define _RPINR32_FLT6R2_LENGTH                   0x00000001

#define _RPINR32_FLT6R3_POSITION                 0x00000003
#define _RPINR32_FLT6R3_MASK                     0x00000008
#define _RPINR32_FLT6R3_LENGTH                   0x00000001

#define _RPINR32_FLT6R4_POSITION                 0x00000004
#define _RPINR32_FLT6R4_MASK                     0x00000010
#define _RPINR32_FLT6R4_LENGTH                   0x00000001

#define _RPINR32_FLT6R5_POSITION                 0x00000005
#define _RPINR32_FLT6R5_MASK                     0x00000020
#define _RPINR32_FLT6R5_LENGTH                   0x00000001

#define _RPINR32_FLT7R0_POSITION                 0x00000008
#define _RPINR32_FLT7R0_MASK                     0x00000100
#define _RPINR32_FLT7R0_LENGTH                   0x00000001

#define _RPINR32_FLT7R1_POSITION                 0x00000009
#define _RPINR32_FLT7R1_MASK                     0x00000200
#define _RPINR32_FLT7R1_LENGTH                   0x00000001

#define _RPINR32_FLT7R2_POSITION                 0x0000000A
#define _RPINR32_FLT7R2_MASK                     0x00000400
#define _RPINR32_FLT7R2_LENGTH                   0x00000001

#define _RPINR32_FLT7R3_POSITION                 0x0000000B
#define _RPINR32_FLT7R3_MASK                     0x00000800
#define _RPINR32_FLT7R3_LENGTH                   0x00000001

#define _RPINR32_FLT7R4_POSITION                 0x0000000C
#define _RPINR32_FLT7R4_MASK                     0x00001000
#define _RPINR32_FLT7R4_LENGTH                   0x00000001

#define _RPINR32_FLT7R5_POSITION                 0x0000000D
#define _RPINR32_FLT7R5_MASK                     0x00002000
#define _RPINR32_FLT7R5_LENGTH                   0x00000001

#define _RPINR33_FLT8R_POSITION                  0x00000000
#define _RPINR33_FLT8R_MASK                      0x0000003F
#define _RPINR33_FLT8R_LENGTH                    0x00000006

#define _RPINR33_SYNCI1R_POSITION                0x00000008
#define _RPINR33_SYNCI1R_MASK                    0x00003F00
#define _RPINR33_SYNCI1R_LENGTH                  0x00000006

#define _RPINR33_FLT8R0_POSITION                 0x00000000
#define _RPINR33_FLT8R0_MASK                     0x00000001
#define _RPINR33_FLT8R0_LENGTH                   0x00000001

#define _RPINR33_FLT8R1_POSITION                 0x00000001
#define _RPINR33_FLT8R1_MASK                     0x00000002
#define _RPINR33_FLT8R1_LENGTH                   0x00000001

#define _RPINR33_FLT8R2_POSITION                 0x00000002
#define _RPINR33_FLT8R2_MASK                     0x00000004
#define _RPINR33_FLT8R2_LENGTH                   0x00000001

#define _RPINR33_FLT8R3_POSITION                 0x00000003
#define _RPINR33_FLT8R3_MASK                     0x00000008
#define _RPINR33_FLT8R3_LENGTH                   0x00000001

#define _RPINR33_FLT8R4_POSITION                 0x00000004
#define _RPINR33_FLT8R4_MASK                     0x00000010
#define _RPINR33_FLT8R4_LENGTH                   0x00000001

#define _RPINR33_FLT8R5_POSITION                 0x00000005
#define _RPINR33_FLT8R5_MASK                     0x00000020
#define _RPINR33_FLT8R5_LENGTH                   0x00000001

#define _RPINR33_SYNCI1R0_POSITION               0x00000008
#define _RPINR33_SYNCI1R0_MASK                   0x00000100
#define _RPINR33_SYNCI1R0_LENGTH                 0x00000001

